# Cadence Genus(TM) Synthesis Solution, Version 21.10-p002_1, built Aug 20 2021 10:13:13

# Date: Mon Jun 05 07:13:01 2023
# Host: vlsicadclient13 (x86_64 w/Linux 3.10.0-957.el7.x86_64) (8cores*8cpus*1physical cpu*Intel(R) Core(TM) i7-9700 CPU @ 3.00GHz 12288KB)
# OS:   Red Hat Enterprise Linux Workstation release 7.6 (Maipo)

set_attr ../lib/
set_attr init_lib_search_path ../lib/
set_attr hdl_search_path ../rtl/
set_attr init_hdl_search_path ../rtl/
set_attr library slow_vdd1v0_basicCells.lib
read_hdl counter.v
elaborate
gui_show
